Fagear/SDVPCMdecoder/stc007datastitcher.h
/**************************************************************************************************************************************************************
stc007datastitcher.h

Copyright © 2023 Maksim Kryukov <fagear@mail.ru>

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.

Created: 2020-06

"Data-stitcher" module for STC-007/PCM-F1/M2 formats. Wrapper for [STC007Deinterleaver].
[STC007DataStitcher] takes input queue of [STC007Line] and puts out set of the [PCMSamplePair] sub-class objects into the output queue.
[STC007DataStitcher] processes data on per-frame basis, waiting for "End Of Frame" service line tag in the input queue before starting processing the queue.
In STC-007 all fields are interlocked, so [STC007DataStitcher] has to collect and keep in memory
at least two adjacent frames to reliably perform all its functions.
[STC007DataStitcher] performs:
    - Vertical data coordinates detection;
    - Frame trimming detection (empty lines discarding);
    - Video standard detection (PAL/NTSC);
    - Field padding detection;
    - Field order detection (TFF/BFF);
    - Audio resolution detection (14/16 bits);
    - Deinterleaving and error correction with [STC007Deinterleaver];
    - [STC007DataBlock] to [PCMSamplePair] conversion;
    - Cross-Word Decoding (CWD) pre-scan ECC assist (if set by [setCWDCorrection()]);
    - Per-frame statistics collection.

Typical use case:
    - Set pointer to the input PCM line queue with [setInputPointers()];
    - Set pointer to the output audio sample queue with [setOutputPointers()];
    - Call [doFrameReassemble()] to start execution loop;
    - Feed data into the input queue that was set with [setInputPointers()].
    -- optional: P-code and Q-code corrections can be toggled with [setPCorrection()] and [setQCorrection()],
                 CWD assist can be toggled with [setCWDCorrection()],
                 video standard can be preset with [setVideoStandard()], field order can be preset with [setFieldOrder()],
                 audio resolution can be preset with [setResolutionPreset()], sample rate can be preset with [setSampleRatePreset()].

[STC007DataStitcher] has a number of fine settings for error correction and masking.
[setDefaultFineSettings()] will set default fine settings.
[requestCurrentFineSettings()] will return current fine settings.
New fine settings can be set with [setFineMaxUnch14()], [setFineMaxUnch16()], [setFineUseECC()],
[setFineTopLineFix()], [setFineMaskSeams()] and [setFineBrokeMask()].

It would be easy to process all lines, deinterleave those and decode into samples if video captures were ideal
and contained all source data lines and in the exact same places every time. But the reality is different.
PCM processors utilize lines in the inactive region right after VBI. Most video capture devices unable to capture inactive region.
Worse than that, different capture devices have different vertical offsets from VBI and it also can vary with video standard (PAL/NTSC).
There are professional capture devices that can capture the whole frame but those are rare and expensive.
This situation introduces static uncertainty to the vertical data coordinates.
If captured video originated from a VTR, it introduces its own defects to the frame.
Misaligned tape transport can introduce additional unknown vertical offset to the data, damaged tape can lead to sync losses, frame rolling, etc.
In edge cases, two fields of the same frame can have different vertical offsets and that offset can jump and vary during playback.
So, VTR introduces dynamic uncertainty to the capture.
Sometimes noise in the picture can be treated as PCM data with invalid CRC by [Binarizer], other times lines with PCM damaged beyond recovery and lost.
If those lines are right at the top or the bottom of the screen the decision has to be made: include those lines in the data stream or not?
Usually capture is done with additional empty lines at the top and/or bottom of the screen.
All that introduces even more uncertainty to the original data location.
The decoder has no way of knowing how many lines been cut from the top of the frame (between VBI and first line of the captured frame)
and where captured lines were placed in the original frame. That's a problem, because even if data is shifted by one line, data alignment will fail
and we'll have incorrectly working error correction and corrupted data in general at the output.

STC-007/PCM-F1 uses inverleaving that is not fixed to field or frame limits, several data blocks can have their source data distributed
between two adjacent field in different proportions, all fields are interlocked together in a chain.
That means that not only vertical position of the data in single frame/field is important,
but that the exact connection of each pair of fields must be preserved, that's critical.

During development of the decoder a note was made that if there are none CRC errors and error correction procedure is forced,
it should return zeroes as syndromes. But if data block was assembled from lines of adjacent fields that were out of alignment,
then even if there were no CRC error flags in the data, syndromes became non-zero, indicating an error in data.
Those data blocks were named "BROKEN" and became a vital part of auto-detection algorithm for padding between fields.
It became clear that data blocks that spanned across two fields will not be "BROKEN"
only in the one case when fields are aligned exactly as those were in the original data stream.
Also another note was made: maximum number of lines that can be missing between fields is 32 for STC-007 and 16 for PCM-F1
(exact limits of burst error correction capabilities) and after that data will be erroneously "fixed" and "BROKEN" blocks will be masked and undetected.

