Fagear/SDVPCMdecoder/stc007datastitcher.h
So, [STC007DataStitcher] implements padding sweeping between each adjacent fields ("stitching" process) inserting from 0 to 32(16) empty lines,
deinterleaving all data blocks on the "seam" between the fields and collecting statistics.
After sorting statistics data [STC007DataStitcher] selects the best result that becomes the set padding between fields.
This must be performed on fields of the same frame and on the fields of adjacent frames.
Thus "inner (interframe) padding" and "outer (frame-to-frame) padding" were introduced.
It was later discovered that the same technique can be used for auto-detecting the field order and audio sample resolution of the data.
[STC007DataStitcher] now can perform additional padding sweeping, trying to set different order of the fields of the two adjacent frames
and different resolution modes to determine correct settings by searching for the minimum of "BROKEN" data blocks.

When error correction for the data block is required (it has CRC flags), it can not be used to detect "BROKEN" state anymore.
So when there are too many "normal" CRC errors in the stream, automatic detection of padding, field order and audio resolution suffers.
Also if samples are silent or near it (~2 LSBs) algorithm also can not reliably detect "BROKEN" blocks.
In cases when algorithm can not reliably detect exact padding, it marks that "seam" as "unchecked"
and error correction is turned off for that seam to prevent clicks and noise from misbehaving error-correction on probably incorrectly aligned fields.
When padding can not be auto-detected, there are fallback algorithms that set padding by number of existing lines in the field
and set field order and audio resolution by previous statistics.

**************************************************************************************************************************************************************/

#ifndef STC007DATASTITCHER_H
#define STC007DATASTITCHER_H

#include <algorithm>
#include <iterator>
#include <deque>
#include <stdint.h>
#include <vector>
#include <QApplication>
#include <QDebug>
#include <QElapsedTimer>
#include <QMutex>
#include <QObject>
#include <QThread>
#include <QString>
#include "config.h"
#include "circbuffer.h"
#include "frametrimset.h"
#include "pcmsamplepair.h"
#include "stc007datablock.h"
#include "stc007deinterleaver.h"
#include "stc007line.h"

#ifndef QT_VERSION
    #undef DI_EN_DBG_OUT
#endif

#ifdef DI_EN_DBG_OUT
    //#define DI_LOG_BUF_WAIT_VERBOSE         1       // Produce verbose output for buffer filling process.
    //#define DI_LOG_BUF_FILL_VERBOSE         1       // Produce verbose output for buffer filling process.
    //#define DI_LOG_TRIM_VERBOSE             1       // Produce verbose output for trimming process.
    //#define DI_LOG_NOLINE_SKIP_VERBOSE      1       // Produce verbose output for line skipping when splitting frames.
    //#define DI_LOG_AUDRES_VERBOSE           1       // Produce verbose output for audio resolution detection.
#endif

// TODO: try to pick best padding for failed stitches by minimum BROKEN blocks
// TODO: don't mask first 32 lines in the failed stitch
// TODO: set parameters according to Control Block, if detected
class STC007DataStitcher : public QObject
{
    Q_OBJECT

public:
    // Console logging options (can be used simultaneously).
    enum
    {
        LOG_SETTINGS = (1<<0),          // External operations with settings.
        LOG_PROCESS = (1<<1),           // General stage-by-stage logging.
        LOG_TRIM = (1<<2),              // Detecting frame trimming
        LOG_DEINTERLEAVE = (1<<3),      // Process of converting lines into data block.
        LOG_ERROR_CORR = (1<<4),        // Process of detecting and correcting errors.
        LOG_PADDING = (1<<5),           // Searching for padding.
        LOG_PADDING_LINE = (1<<6),      // Dump PCM lines while adjusting padding.
        LOG_PADDING_BLOCK = (1<<7),     // Show data blocks while adjusting padding.
        LOG_FIELD_ASSEMBLY = (1<<8),    // Show process of assembling new fields with padding.
        LOG_UNSAFE = (1<<9),            // Show process of marking unsafe data blocks.
        LOG_BLOCK_DUMP = (1<<10)        // Dump PCM data block after data block processing is complete.
    };

    // Frame parameters.
    enum
    {
        LINES_PF_NTSC = (LINES_PER_NTSC_FIELD),     // PCM lines in one field of a frame for STC-007 NTSC video standard.
        LINES_PF_PAL = (LINES_PER_PAL_FIELD),       // PCM lines in one field of a frame for STC-008 PAL video standard.
        LINES_PF_DEFAULT = (LINES_PF_NTSC),         // Default video standard if not detected automatically.
        LINES_PF_MAX_PAL = (LINES_PF_PAL+STC007DataBlock::INTERLEAVE_OFS),      // Maximum number of lines with data in the field until [VID_UNKNOWN] assumed above [VID_PAL].
        LINES_PF_MAX_NTSC = (LINES_PF_PAL-2*STC007DataBlock::INTERLEAVE_OFS),   // Maximum number of lines with data in the field until [VID_PAL] assumed above [VID_NTSC].
        FLD_ORDER_DEFAULT = (FrameAsmDescriptor::ORDER_TFF)   // Default field order if not detected while padding.
    };

    // Buffer limits.
    enum
    {
        BUF_SIZE_TRIM = (MAX_VLINE_QUEUE_SIZE*3),   // Maximum number of lines to store in [trim_buf] buffer (must contain at least two full frames).
        BUF_SIZE_FIELD = LINES_PER_PAL_FIELD,       // Maximum number of lines to store in per-field buffers.
        MIN_GOOD_LINES_PF = (LINES_PF_DEFAULT-(STC007DataBlock::INTERLEAVE_OFS)/2), // Minimum number of lines with good CRC per field to enable aggresive trimming.
        MIN_FILL_LINES_PF = (STC007DataBlock::MIN_DEINT_DATA/2),                    // Minimum number of lines in per-field buffers to perform padding detection.
    };

    // Paddings limits.
    enum
    {
        MAX_PADDING_14BIT = (STC007DataBlock::INTERLEAVE_OFS*2),    // Maximum available line padding (for 14-bit mode) before Q false corrections will ruin field stitching.
        MAX_PADDING_16BIT = (STC007DataBlock::INTERLEAVE_OFS),      // Maximum available line padding (for 16-bit mode) before two errors per block will be introduced.
        MAX_BURST_SILENCE = (STC007DataBlock::INTERLEAVE_OFS/2),    // Maximum number of consequtive silenced data blocks before field stitching aborts.
        MAX_BURST_BROKEN = 1,                                       // Maximum number of consequtive BROKEN data blocks before field stitching aborts.
        MAX_BURST_UNCH_DELTA = 8,
        MAX_BURST_UNCH_14BIT = 0x40,                                // Default maximum number of consequtive unchecked/Q-corrected 14-bit data blocks before field stitching aborts.
        MAX_BURST_UNCH_16BIT = 0x20,                                // Default maximum number of consequtive unchecked 16-bit data blocks before field stitching aborts.
        UNCH_MASK_DURATION = (STC007DataBlock::INTERLEAVE_OFS*STC007DataBlock::WORD_CNT),   // Default duration (in lines) of masking uncheckable and false-corrected blocks after BROKEN one.
        STATS_DEPTH = 65                                            // History depth for stats.
    };

    // Results of [findFieldResolution()].
    enum
    {
        SAMPLE_RES_UNKNOWN,     // Unable to determine resolution.
        SAMPLE_RES_14BIT,       // Detected field resolution: 14-bit (STC-007).
        SAMPLE_RES_16BIT,       // Detected field resolution: 16-bit (PCM-F1).
        SAMPLE_RES_MAX
    };

