Fagear/SDVPCMdecoder/stc007datastitcher.h
    // Results of [tryPadding()] and [findPadding()].
    enum
    {
        DS_RET_NO_DATA,         // Provided PCM line buffer is too small to get data out.
        DS_RET_SILENCE,         // Can not check parity and ECC due to total silence.
        DS_RET_BROKE,           // Incorrect padding due to broken data.
        DS_RET_NO_PAD,          // Can not find correct padding.
        DS_RET_OK               // Processing done successfully.
    };

    // Stages of processing.
    enum
    {
        STG_TRY_PREVIOUS,       // Try to stitch fields as before.
        STG_TRY_TFF_TO_TFF,     // Try to stitch current frame with next one as before, assuming Frame A is TFF and Frame B is TFF.
        STG_TRY_BFF_TO_BFF,     // Try to stitch current frame with next one as before, assuming Frame A is BFF and Frame B is BFF.
        STG_A_PREPARE,          // Getting ready to find padding between fields of Frame A.
        STG_A_PAD_TFF,          // Detecting padding between fields of Frame A, assuming TFF (top (odd) field, then bottom (even) field).
        STG_A_PAD_BFF,          // Detecting padding between fields of Frame A, assuming BFF (bottom (even) field, then top (odd) field).
        STG_AB_UNK_PREPARE,     // Getting ready to find padding between different frames, while Frame A padding is unknown.
        STG_AB_TFF_TO_TFF,      // Detecting padding between different frames, assuming Frame A is TFF and Frame B is TFF.
        STG_AB_TFF_TO_BFF,      // Detecting padding between different frames, assuming Frame A is TFF and Frame B is BFF.
        STG_AB_BFF_TO_BFF,      // Detecting padding between different frames, assuming Frame A is BFF and Frame B is BFF.
        STG_AB_BFF_TO_TFF,      // Detecting padding between different frames, assuming Frame A is BFF and Frame B is TFF.
        STG_PAD_NO_GOOD,        // Padding detection failed.
        STG_PAD_SILENCE,        // Padding detection can not be performed on silence.
        STG_PAD_OK,             // Padding done successfully.
        STG_PAD_MAX             // Limiter for stages.
    };

private:
    STC007DataBlock padding_block;              // Data block object, used in padding process.
    STC007Deinterleaver pad_checker;            // Deinterleaver object, used for padding detection.
    STC007Deinterleaver lines_to_block;         // Deinterleaver object, used for final lines-block processing.
    FrameAsmSTC007 frasm_f0;                    // Frame assembling for the previous frame.
    FrameAsmSTC007 frasm_f1;                    // Frame assembling for the current frame (Frame A).
    FrameAsmSTC007 frasm_f2;                    // Frame assembling for the next frame (Frame B).
    QElapsedTimer file_time;                    // Timer for measuring file processing time.
    std::deque<STC007Line> *in_lines;           // Input PCM line quene (shared).
    std::deque<PCMSamplePair> *out_samples;     // Output sample pairs queue (shared).
    QMutex *mtx_lines;                          // Mutex for input queue.
    QMutex *mtx_samples;                        // Mutex for output queue.
    std::vector<STC007Line> trim_buf;           // Internal buffer for collecting two frames and trimming detection.
    std::vector<STC007Line> frame1_even;        // Internal buffer for Frame A even field for padding detection.
    std::vector<STC007Line> frame1_odd;         // Internal buffer for Frame A odd field for padding detection.
    std::vector<STC007Line> frame2_even;        // Internal buffer for Frame B even field for padding detection.
    std::vector<STC007Line> frame2_odd;         // Internal buffer for Frame B odd field for padding detection.
    std::deque<STC007Line> padding_queue;       // Internal buffer for field padding detection.
    std::deque<STC007Line> conv_queue;          // Output PCM lines buffer after trimming and padding, before converting into data blocks.
    std::string file_name;                      // Name of the file being processed (passed onto audio processing chain).
    uint8_t max_unchecked_14b_blocks;           // Maximum number of consequtive unchecked data blocks for a seam in 14-bit mode.
    uint8_t max_unchecked_16b_blocks;           // Maximum number of consequtive unchecked data blocks for a seam in 16-bit mode.
    uint8_t broken_mask_dur;                    // Duration (in lines) for error masking after BROKEN data block (cleans small number of small clicks).
    uint8_t broken_countdown;                   // How many data blocks to invalidate after BROKEN data block.
    uint8_t preset_video_mode;                  // Detected video standard.
    uint8_t preset_field_order;                 // Field order, set externally.
    uint8_t preset_audio_res;                   // Resolution of audio samples, set externally.
    uint8_t last_pad_counter;                   // Last padding runs count in [tryPadding()].
    circarray<uint8_t, STATS_DEPTH> stats_field_order;  // List of last field orders.
    circarray<uint8_t, STATS_DEPTH> stats_resolution;   // List of last audio sample resolutions.
    uint16_t log_level;                         // Level of debug output.
    uint16_t trim_fill;                         // Number of filled lines in [trim_buf] from input queue.
    uint16_t f1_max_line;                       // Largest line number in Frame A (used to determine video standard by line count).
    uint16_t f2_max_line;                       // Largest line number in Frame B (used to determine video standard by line count).
    uint16_t preset_sample_rate;                // Sample rate of audio samples, set externally.
    bool file_start;                            // Detected start of a new file, filename saved to [file_name].
    bool file_end;                              // Detected end of a file.
    bool ignore_CRC;                            // Ignore CRC from video lines or not (and force parity check).
    bool enable_P_code;                         // Enable P-code error correction or not.
    bool enable_Q_code;                         // Enable Q-code error correction or not.
    bool enable_CWD;                            // Enable CWD (Cross-Word Decoding) error correction or not.
    bool mode_m2;                               // Set new M2 mode and disable STC-007/PCM-F1 output.
    bool fix_cut_above;                         // Add artificial line to begining of the frame for frames with invalid seams.
    bool mask_seams;                            // Mark data blocks on incorrect field seams as invalid (cleans most of clicks and pops on bad quality video).
    bool finish_work;                           // Flag to break executing loop.

