Fagear/SDVPCMdecoder/stc007datastitcher.h
public:
    explicit STC007DataStitcher(QObject *parent = 0);
    void setInputPointers(std::deque<STC007Line> *in_pcmline = NULL, QMutex *mtx_pcmline = NULL);
    void setOutputPointers(std::deque<PCMSamplePair> *out_pcmsamples = NULL, QMutex *mtx_pcmsamples = NULL);

private:
    void resetState();
    bool waitForTwoFrames();
    void fillUntilTwoFrames();
    void findFramesTrim();
    void splitFramesToFields();
    uint8_t getFieldResolution(std::vector<STC007Line> *field = NULL, uint16_t f_size = 0);
    uint8_t getResolutionModeForSeam(uint8_t in_res_field1, uint8_t in_res_field2);
    uint8_t getResolutionForSeam(uint8_t in_res_field1, uint8_t in_res_field2);
    uint8_t getDataBlockResolution(std::deque<STC007Line> *in_line_buffer = NULL, uint16_t line_sh = 0);
    uint8_t tryPadding(std::vector<STC007Line> *field1 = NULL, uint16_t f1_size = 0,
                        std::vector<STC007Line> *field2 = NULL, uint16_t f2_size = 0,
                        uint16_t padding = 0,
                        FieldStitchStats *stitch_stats = NULL);
    uint8_t findPadding(std::vector<STC007Line> *field1 = NULL, uint16_t f1_size = 0,
                        std::vector<STC007Line> *field2 = NULL, uint16_t f2_size = 0,
                        uint8_t in_std = FrameAsmDescriptor::VID_NTSC, uint8_t in_resolution = STC007DataBlock::RES_14BIT, uint16_t *padding = NULL);
    void clearFieldOrderStats();
    void updateFieldOrderStats(uint8_t new_order);
    uint8_t getProbableFieldOrder();
    void clearResolutionStats();
    void updateResolutionStats(uint8_t new_res);
    uint8_t getProbableResolution();
    void detectAudioResolution();
    void detectVideoStandard();
    uint8_t findFieldStitching();
    uint8_t getAssemblyFieldOrder();
    uint16_t getFirstFieldLineNum(uint8_t in_order);
    uint16_t getSecondFieldLineNum(uint8_t in_order);
    uint16_t addLinesFromField(std::vector<STC007Line> *field_buf, uint16_t ind_start, uint16_t count, uint16_t *last_line_num = NULL);
    uint16_t addFieldPadding(uint32_t in_frame, uint16_t line_cnt, uint16_t *last_line_num = NULL);
    bool isBlockNoReport(STC007DataBlock *in_block);
    void fillFrameForOutput();
    bool fillNextFieldForCWD();
    void removeNextFieldAfterCWD();
    uint16_t patchBrokenLines(std::deque<STC007Line> *in_queue);
    uint16_t patchBrokenLinesOld(std::deque<STC007Line> *in_queue);
    uint16_t performCWD(std::deque<STC007Line> *in_queue);
    void prescanFrame();
    void setBlockSampleRate(STC007DataBlock *in_block);
    void outputFileStart();
    void outputSamplePair(STC007DataBlock *in_block, uint8_t idx_left, uint8_t idx_right);
    void outputDataBlock(STC007DataBlock *in_block = NULL);
    void outputFileStop();
    void performDeinterleave();

public slots:
    void setLogLevel(uint16_t);             // Set logging level.
    void setVideoStandard(uint8_t);         // Preset video standard for stitching.
    void setFieldOrder(uint8_t);            // Preset field order.
    void setPCorrection(bool);              // Enable/disable P-code error correction.
    void setQCorrection(bool);              // Enable/disable Q-code error correction.
    void setCWDCorrection(bool);            // Enable/disable CWD error correction.
    void setM2SampleFormat(bool);           // Enable/disable M2 sample format (13/16-bits in 14-bit words).
    void setResolutionPreset(uint8_t);      // Preset audio resolution.
    void setSampleRatePreset(uint16_t);     // Preset audio sample rate.
    void setFineMaxUnch14(uint8_t);         // Set fine settings: maximum unchecked data blocks for a seam in 14-bit mode.
    void setFineMaxUnch16(uint8_t);         // Set fine settings: maximum unchecked data blocks for a seam in 16-bit mode.
    void setFineUseECC(bool);               // Set fine settings: usage of ECC on CRC-marked words.
    void setFineMaskSeams(bool);            // Set fine settings: usage of unchecked seams masking.
    void setFineBrokeMask(uint8_t);         // Set fine settings: number of lines to mask after BROKEN data block.
    void setFineTopLineFix(bool);           // Set fine settings: allow automatic top-line insertion in odd line counted frames.
    void setDefaultFineSettings();          // Set fine settings to defaults.
    void requestCurrentFineSettings();      // Get current fine settings.
    void doFrameReassemble();               // Main execution loop.
    void stop();                            // Set the flag to break execution loop and exit.

signals:
    void guiUpdFrameAsm(FrameAsmSTC007);    // New frame assembling data calculated in DI thread, need to update GUI.
    void guiUpdFineMaxUnch14(uint8_t);      // New fine setting: maximum unchecked data blocks for a seam in 14-bit mode.
    void guiUpdFineMaxUnch16(uint8_t);      // New fine setting: maximum unchecked data blocks for a seam in 16-bit mode.
    void guiUpdFineUseECC(bool);            // New fine setting: usage of ECC on CRC-marked words.
    void guiUpdFineMaskSeams(bool);         // New fine setting: usage of unchecked seams masking.
    void guiUpdFineBrokeMask(uint8_t);      // New fine setting: number of lines to mask after BROKEN data block.
    void guiUpdFineTopLineFix(bool);        // New fine setting: allow automatic top-line insertion in odd line counted frames.
    void newLineProcessed(STC007Line);      // Processed STC-007 line object (for visualization).
    void newBlockProcessed(STC007DataBlock);    // Processed STC-007 data block object (for visualization).
    void loopTime(quint64);                 // Useful loop time count.
    void finished();                        // Thread is stopped.
};

#endif // STC007DATASTITCHER_H
